%% -*- coding: latin-1 -*-
%%----------------------------------
%% Statements:
%% @module      NPC配置表
%% @author      cablsbs
%%----------------------------------
-module(conf_npc).

-export([
	get/1
]).

get(1) ->
    #{id => 1, name => <<"月老">>, scene => 10000};
get(2) ->
    #{id => 2, name => <<"喜娘">>, scene => 10000};
get(3) ->
    #{id => 3, name => <<"丘比特">>, scene => 10000};
get(4) ->
    #{id => 4, name => <<"王夫子">>, scene => 10000};
get(5) ->
    #{id => 5, name => <<"段夫子">>, scene => 10000};
get(6) ->
    #{id => 6, name => <<"赵鹏友">>, scene => 10000};
get(7) ->
    #{id => 7, name => <<"范纯义">>, scene => 10000};
get(8) ->
    #{id => 8, name => <<"文彦博">>, scene => 10000};
get(9) ->
    #{id => 9, name => <<"刘博">>, scene => 10000};
get(10) ->
    #{id => 10, name => <<"狄青">>, scene => 10000};
get(11) ->
    #{id => 11, name => <<"周天师">>, scene => 10000};
get(12) ->
    #{id => 12, name => <<"聂政">>, scene => 10000};
get(13) ->
    #{id => 13, name => <<"苏星河">>, scene => 10000};
get(14) ->
    #{id => 14, name => <<"江湖百晓生">>, scene => 10000};
get(15) ->
    #{id => 15, name => <<"吴玠">>, scene => 10000};
get(16) ->
    #{id => 16, name => <<"欧阳修">>, scene => 10000};
get(17) ->
    #{id => 17, name => <<"钱宏宇">>, scene => 10000};
get(18) ->
    #{id => 18, name => <<"李纲">>, scene => 10000};
get(19) ->
    #{id => 19, name => <<"潘菁菁">>, scene => 10000};
get(20) ->
    #{id => 20, name => <<"程青霜">>, scene => 10000};
get(21) ->
    #{id => 21, name => <<"乔芊">>, scene => 10000};
get(22) ->
    #{id => 22, name => <<"石义">>, scene => 10000};
get(23) ->
    #{id => 23, name => <<"云涵儿">>, scene => 10000};
get(24) ->
    #{id => 24, name => <<"云仙儿">>, scene => 10000};
get(25) ->
    #{id => 25, name => <<"李校尉">>, scene => 10000};
get(26) ->
    #{id => 26, name => <<"木婉清">>, scene => 10000};
get(27) ->
    #{id => 27, name => <<"钟灵儿">>, scene => 10000};
get(28) ->
    #{id => 28, name => <<"段誉">>, scene => 10000};
get(29) ->
    #{id => 29, name => <<"赵天师">>, scene => 10000};
get(30) ->
    #{id => 30, name => <<"李侍郎">>, scene => 10000};
get(31) ->
    #{id => 31, name => <<"田大娘">>, scene => 10000};
get(32) ->
    #{id => 32, name => <<"李清">>, scene => 10000};
get(33) ->
    #{id => 33, name => <<"杨铁宗">>, scene => 10000};
get(34) ->
    #{id => 34, name => <<"骁勇校尉">>, scene => 10000};
get(35) ->
    #{id => 35, name => <<"云飘飘">>, scene => 10000};
get(36) ->
    #{id => 36, name => <<"乔峰">>, scene => 10000};
get(37) ->
    #{id => 37, name => <<"依天彩">>, scene => 10000};
get(38) ->
    #{id => 38, name => <<"燕如雪">>, scene => 10000};
get(39) ->
    #{id => 39, name => <<"田宇">>, scene => 10000};
get(40) ->
    #{id => 40, name => <<"段正淳">>, scene => 10000};
get(41) ->
    #{id => 41, name => <<"小雯">>, scene => 10000};
get(42) ->
    #{id => 42, name => <<"风波恶">>, scene => 10000};
get(43) ->
    #{id => 43, name => <<"欧治子">>, scene => 10000};
get(44) ->
    #{id => 44, name => <<"苏来环">>, scene => 10000};
get(45) ->
    #{id => 45, name => <<"三生蝶">>, scene => 10000};
get(46) ->
    #{id => 46, name => <<"断情">>, scene => 10000};
get(47) ->
    #{id => 47, name => <<"雅轩">>, scene => 10000};
get(1001) ->
    #{id => 1001, name => <<"琅嬛福地">>, scene => 10001};
get(1002) ->
    #{id => 1002, name => <<"钟灵儿">>, scene => 10001};
get(1003) ->
    #{id => 1003, name => <<"闪电貂">>, scene => 10001};
get(1004) ->
    #{id => 1004, name => <<"段誉">>, scene => 10001};
get(1005) ->
    #{id => 1005, name => <<"琅嬛玉像">>, scene => 10001};
get(1006) ->
    #{id => 1006, name => <<"蝶妖">>, scene => 10001};
get(1007) ->
    #{id => 1007, name => <<"龚光杰">>, scene => 10002};
get(1008) ->
    #{id => 1008, name => <<"钟灵儿">>, scene => 10002};
get(1009) ->
    #{id => 1009, name => <<"容子矩">>, scene => 10002};
get(1010) ->
    #{id => 1010, name => <<"神农帮弟子">>, scene => 10002};
get(1011) ->
    #{id => 1011, name => <<"灵鹫宫弟子">>, scene => 10002};
get(1012) ->
    #{id => 1012, name => <<"段誉">>, scene => 10002};
get(1013) ->
    #{id => 1013, name => <<"木婉清">>, scene => 10002};
get(1014) ->
    #{id => 1014, name => <<"木婉清">>, scene => 10000};
get(1015) ->
    #{id => 1015, name => <<"钟灵儿">>, scene => 10000};
get(1016) ->
    #{id => 1016, name => <<"段誉">>, scene => 10000};
get(1017) ->
    #{id => 1017, name => <<"赵天师">>, scene => 10000};
get(1018) ->
    #{id => 1018, name => <<"李侍郎">>, scene => 10000};
get(1019) ->
    #{id => 1019, name => <<"田大娘">>, scene => 10000};
get(1020) ->
    #{id => 1020, name => <<"李清">>, scene => 10000};
get(1021) ->
    #{id => 1021, name => <<"杨铁宗">>, scene => 10000};
get(1022) ->
    #{id => 1022, name => <<"骁勇校尉">>, scene => 10000};
get(1023) ->
    #{id => 1023, name => <<"云飘飘">>, scene => 10000};
get(1024) ->
    #{id => 1024, name => <<"郭宇">>, scene => 10004};
get(1025) ->
    #{id => 1025, name => <<"钟万仇">>, scene => 10004};
get(1026) ->
    #{id => 1026, name => <<"乔峰">>, scene => 10004};
get(1027) ->
    #{id => 1027, name => <<"阿朱">>, scene => 10004};
get(1028) ->
    #{id => 1028, name => <<"蒋舵主">>, scene => 10004};
get(1029) ->
    #{id => 1029, name => <<"张三">>, scene => 10004};
get(1030) ->
    #{id => 1030, name => <<"李四">>, scene => 10004};
get(1031) ->
    #{id => 1031, name => <<"包打听">>, scene => 10004};
get(1032) ->
    #{id => 1032, name => <<"薛慕华">>, scene => 10004};
get(1033) ->
    #{id => 1033, name => <<"玄难">>, scene => 10004};
get(1034) ->
    #{id => 1034, name => <<"燕别秋">>, scene => 10004};
get(1035) ->
    #{id => 1035, name => <<"嬴无名">>, scene => 10006};
get(1036) ->
    #{id => 1036, name => <<"朱丹臣">>, scene => 10006};
get(1037) ->
    #{id => 1037, name => <<"木婉清">>, scene => 10006};
get(1038) ->
    #{id => 1038, name => <<"本观">>, scene => 10006};
get(1039) ->
    #{id => 1039, name => <<"古木">>, scene => 10006};
get(1040) ->
    #{id => 1040, name => <<"本相">>, scene => 10006};
get(1041) ->
    #{id => 1041, name => <<"段誉">>, scene => 10006};
get(1042) ->
    #{id => 1042, name => <<"本因">>, scene => 10006};
get(1043) ->
    #{id => 1043, name => <<"本参">>, scene => 10006};
get(1044) ->
    #{id => 1044, name => <<"枯荣大师">>, scene => 10006};
get(1045) ->
    #{id => 1045, name => <<"段正明">>, scene => 10006};
get(1046) ->
    #{id => 1046, name => <<"卿卿公主">>, scene => 10006};
get(1047) ->
    #{id => 1047, name => <<"秦红棉">>, scene => 10006};
get(1048) ->
    #{id => 1048, name => <<"黄庭坚">>, scene => 10006};
get(1049) ->
    #{id => 1049, name => <<"巴天石">>, scene => 10006};
get(1050) ->
    #{id => 1050, name => <<"杨继业">>, scene => 10006};
get(1051) ->
    #{id => 1051, name => <<"辛弃疾">>, scene => 10006};
get(1052) ->
    #{id => 1052, name => <<"李清照">>, scene => 10006};
get(1053) ->
    #{id => 1053, name => <<"善良的树妖">>, scene => 10006};
get(1054) ->
    #{id => 1054, name => <<"范晔">>, scene => 10006};
get(1055) ->
    #{id => 1055, name => <<"村民王二">>, scene => 10006};
get(1056) ->
    #{id => 1056, name => <<"高升泰">>, scene => 10006};
get(1057) ->
    #{id => 1057, name => <<"顾念">>, scene => 10006};
get(1058) ->
    #{id => 1058, name => <<"阮星竹">>, scene => 10006};
get(1060) ->
    #{id => 1060, name => <<"陈孤雁">>, scene => 10008};
get(1061) ->
    #{id => 1061, name => <<"云中鹤">>, scene => 10008};
get(1062) ->
    #{id => 1062, name => <<"善良的树妖">>, scene => 10008};
get(1063) ->
    #{id => 1063, name => <<"吴领军">>, scene => 10008};
get(1064) ->
    #{id => 1064, name => <<"阿碧">>, scene => 10008};
get(1065) ->
    #{id => 1065, name => <<"张大山">>, scene => 10008};
get(1066) ->
    #{id => 1066, name => <<"过彦之">>, scene => 10008};
get(1067) ->
    #{id => 1067, name => <<"崔百泉">>, scene => 10008};
get(1068) ->
    #{id => 1068, name => <<"陆秀夫">>, scene => 10008};
get(1069) ->
    #{id => 1069, name => <<"风波恶">>, scene => 10008};
get(1070) ->
    #{id => 1070, name => <<"文天祥">>, scene => 10008};
get(1071) ->
    #{id => 1071, name => <<"王夫人">>, scene => 10008};
get(1072) ->
    #{id => 1072, name => <<"王语嫣">>, scene => 10008};
get(1073) ->
    #{id => 1073, name => <<"段誉">>, scene => 10008};
get(1074) ->
    #{id => 1074, name => <<"鸠摩智">>, scene => 10008};
get(1075) ->
    #{id => 1075, name => <<"智光大师">>, scene => 10008};
get(1076) ->
    #{id => 1076, name => <<"丫鬟">>, scene => 10008};
get(1077) ->
    #{id => 1077, name => <<"苟读">>, scene => 10008};
get(1078) ->
    #{id => 1078, name => <<"不平道长">>, scene => 10008};
get(1079) ->
    #{id => 1079, name => <<"李德财">>, scene => 10008};
get(1080) ->
    #{id => 1080, name => <<"邓百川">>, scene => 10010};
get(1081) ->
    #{id => 1081, name => <<"朱丹臣">>, scene => 10010};
get(1082) ->
    #{id => 1082, name => <<"褚万里">>, scene => 10010};
get(1083) ->
    #{id => 1083, name => <<"黄老石">>, scene => 10010};
get(1084) ->
    #{id => 1084, name => <<"阿紫">>, scene => 10010};
get(1085) ->
    #{id => 1085, name => <<"阮星竹">>, scene => 10010};
get(1086) ->
    #{id => 1086, name => <<"段正淳">>, scene => 10010};
get(1087) ->
    #{id => 1087, name => <<"韩世忠">>, scene => 10010};
get(1088) ->
    #{id => 1088, name => <<"周邦彦">>, scene => 10010};
get(1089) ->
    #{id => 1089, name => <<"善良的树妖">>, scene => 10010};
get(1090) ->
    #{id => 1090, name => <<"东方婷">>, scene => 10010};
get(1091) ->
    #{id => 1091, name => <<"刘震">>, scene => 10010};
get(1092) ->
    #{id => 1092, name => <<"小强">>, scene => 10010};
get(1093) ->
    #{id => 1093, name => <<"李德进">>, scene => 10010};
get(1094) ->
    #{id => 1094, name => <<"阿雪">>, scene => 10010};
get(1095) ->
    #{id => 1095, name => <<"梁红玉">>, scene => 10010};
get(1096) ->
    #{id => 1096, name => <<"爽姐">>, scene => 10010};
get(1097) ->
    #{id => 1097, name => <<"乔峰">>, scene => 10010};
get(1098) ->
    #{id => 1098, name => <<"武松">>, scene => 10010};
get(1099) ->
    #{id => 1099, name => <<"傅思归">>, scene => 10010};
get(1100) ->
    #{id => 1100, name => <<"韩映雪">>, scene => 10011};
get(1101) ->
    #{id => 1101, name => <<"锐峰">>, scene => 10011};
get(1102) ->
    #{id => 1102, name => <<"丁欢">>, scene => 10011};
get(1103) ->
    #{id => 1103, name => <<"甘宝宝">>, scene => 10011};
get(1104) ->
    #{id => 1104, name => <<"崔绿华">>, scene => 10011};
get(1105) ->
    #{id => 1105, name => <<"孟龙">>, scene => 10011};
get(1106) ->
    #{id => 1106, name => <<"康广陵">>, scene => 10011};
get(1107) ->
    #{id => 1107, name => <<"苏星河">>, scene => 10011};
get(1108) ->
    #{id => 1108, name => <<"黄裳">>, scene => 10011};
get(1109) ->
    #{id => 1109, name => <<"哑仆">>, scene => 10011};
get(1110) ->
    #{id => 1110, name => <<"善良的树妖">>, scene => 10011};
get(1111) ->
    #{id => 1111, name => <<"米芾">>, scene => 10011};
get(1112) ->
    #{id => 1112, name => <<"高俅">>, scene => 10011};
get(1113) ->
    #{id => 1113, name => <<"玄难">>, scene => 10011};
get(1114) ->
    #{id => 1114, name => <<"包不同">>, scene => 10011};
get(1115) ->
    #{id => 1115, name => <<"薛慕华">>, scene => 10011};
get(1116) ->
    #{id => 1116, name => <<"出尘子">>, scene => 10011};
get(1117) ->
    #{id => 1117, name => <<"狮吼子">>, scene => 10011};
get(1118) ->
    #{id => 1118, name => <<"鲁智深">>, scene => 10011};
get(1119) ->
    #{id => 1119, name => <<"木紫黎">>, scene => 10012};
get(1120) ->
    #{id => 1120, name => <<"林冲">>, scene => 10012};
get(1121) ->
    #{id => 1121, name => <<"刘潇潇">>, scene => 10012};
get(1122) ->
    #{id => 1122, name => <<"吴玠">>, scene => 10012};
get(1123) ->
    #{id => 1123, name => <<"符敏仪">>, scene => 10012};
get(1124) ->
    #{id => 1124, name => <<"张大海">>, scene => 10012};
get(1125) ->
    #{id => 1125, name => <<"善良的树妖">>, scene => 10012};
get(1126) ->
    #{id => 1126, name => <<"石嫂">>, scene => 10012};
get(1127) ->
    #{id => 1127, name => <<"余婆">>, scene => 10012};
get(1128) ->
    #{id => 1128, name => <<"兰剑">>, scene => 10012};
get(1129) ->
    #{id => 1129, name => <<"梅剑">>, scene => 10012};
get(1130) ->
    #{id => 1130, name => <<"竹剑">>, scene => 10012};
get(1132) ->
    #{id => 1132, name => <<"菊剑">>, scene => 10012};
get(1133) ->
    #{id => 1133, name => <<"虚竹">>, scene => 10012};
get(1134) ->
    #{id => 1134, name => <<"昊天部弟子">>, scene => 10012};
get(1135) ->
    #{id => 1135, name => <<"钧天部弟子">>, scene => 10012};
get(1136) ->
    #{id => 1136, name => <<"卓不凡">>, scene => 10012};
get(1137) ->
    #{id => 1137, name => <<"不平道人">>, scene => 10012};
get(1138) ->
    #{id => 1138, name => <<"哈大霸">>, scene => 10012};
get(1139) ->
    #{id => 1139, name => <<"贺铸">>, scene => 10012};
get(1140) ->
    #{id => 1140, name => <<"韩琦">>, scene => 10012};
get(1141) ->
    #{id => 1141, name => <<"黎夫人">>, scene => 10012};
get(1142) ->
    #{id => 1142, name => <<"桑土公">>, scene => 10012};
get(1143) ->
    #{id => 1143, name => <<"乌老大">>, scene => 10012};
get(1144) ->
    #{id => 1144, name => <<"天山童姥">>, scene => 10012};
get(1145) ->
    #{id => 1145, name => <<"李秋水">>, scene => 10012};
get(1131) ->
    #{id => 1131, name => <<"孟婆">>, scene => 11001};
get(1201) ->
    #{id => 1201, name => <<"汪剑通">>, scene => 10004};
get(1202) ->
    #{id => 1202, name => <<"传功长老">>, scene => 10004};
get(1203) ->
    #{id => 1203, name => <<"丐帮弟子">>, scene => 10004};
get(1204) ->
    #{id => 1204, name => <<"全冠清">>, scene => 10004};
get(1205) ->
    #{id => 1205, name => <<"向望海">>, scene => 10004};
get(1206) ->
    #{id => 1206, name => <<"鲍千灵">>, scene => 10004};
get(1207) ->
    #{id => 1207, name => <<"祁老六">>, scene => 10004};
get(1208) ->
    #{id => 1208, name => <<"聚贤庄守卫">>, scene => 10004};
get(1209) ->
    #{id => 1209, name => <<"云中鹤">>, scene => 10004};
get(1210) ->
    #{id => 1210, name => <<"谭公">>, scene => 10004};
get(1211) ->
    #{id => 1211, name => <<"游骥">>, scene => 10004};
get(1301) ->
    #{id => 1301, name => <<"刀白凤">>, scene => 10006};
get(1302) ->
    #{id => 1302, name => <<"鸠摩智">>, scene => 10006};
get(1303) ->
    #{id => 1303, name => <<"岳老三">>, scene => 10006};
get(1304) ->
    #{id => 1304, name => <<"云中鹤">>, scene => 10006};
get(1305) ->
    #{id => 1305, name => <<"本因方丈">>, scene => 10006};
get(1306) ->
    #{id => 1306, name => <<"保定帝">>, scene => 10006};
get(1307) ->
    #{id => 1307, name => <<"叶二娘">>, scene => 10006};
get(1401) ->
    #{id => 1401, name => <<"段家家将">>, scene => 10008};
get(1402) ->
    #{id => 1402, name => <<"王母">>, scene => 10008};
get(1403) ->
    #{id => 1403, name => <<"慕容家将">>, scene => 10008};
get(1404) ->
    #{id => 1404, name => <<"慕容复">>, scene => 10008};
get(1501) ->
    #{id => 1501, name => <<"阿朱">>, scene => 10010};
get(1502) ->
    #{id => 1502, name => <<"叶二娘">>, scene => 10010};
get(1503) ->
    #{id => 1503, name => <<"巴天石">>, scene => 10010};
get(1504) ->
    #{id => 1504, name => <<"岳老三">>, scene => 10010};
get(1505) ->
    #{id => 1505, name => <<"段延庆">>, scene => 10010};
get(1601) ->
    #{id => 1601, name => <<"传功长老">>, scene => 10011};
get(1602) ->
    #{id => 1602, name => <<"汪剑通">>, scene => 10011};
get(1603) ->
    #{id => 1603, name => <<"逍遥派弟子">>, scene => 10011};
get(1604) ->
    #{id => 1604, name => <<"段延庆">>, scene => 10011};
get(1605) ->
    #{id => 1605, name => <<"段誉">>, scene => 10011};
get(1606) ->
    #{id => 1606, name => <<"范百龄">>, scene => 10011};
get(1607) ->
    #{id => 1607, name => <<"丁春秋">>, scene => 10011};
get(1608) ->
    #{id => 1608, name => <<"鸠摩智">>, scene => 10011};
get(1609) ->
    #{id => 1609, name => <<"虚竹">>, scene => 10011};
get(1610) ->
    #{id => 1610, name => <<"无崖子">>, scene => 10011};
get(1801) ->
    #{id => 1801, name => <<"鸠摩智">>, scene => 10006};
get(1802) ->
    #{id => 1802, name => <<"段誉">>, scene => 10006};
get(1803) ->
    #{id => 1803, name => <<"段正淳">>, scene => 10006};
get(1804) ->
    #{id => 1804, name => <<"龚光杰">>, scene => 10002};
get(1805) ->
    #{id => 1805, name => <<"钟灵儿">>, scene => 10002};
get(1806) ->
    #{id => 1806, name => <<"段誉">>, scene => 10002};
get(1807) ->
    #{id => 1807, name => <<"神农帮弟子">>, scene => 10002};
get(1808) ->
    #{id => 1808, name => <<"灵鹫宫弟子">>, scene => 10002};
get(1809) ->
    #{id => 1809, name => <<"容子矩">>, scene => 10002};
get(1810) ->
    #{id => 1810, name => <<"木婉清">>, scene => 10002};
get(1811) ->
    #{id => 1811, name => <<"琅嬛福地">>, scene => 10001};
get(1992) ->
    #{id => 1992, name => <<"周天师">>, scene => 10000};
get(1993) ->
    #{id => 1993, name => <<"乔峰">>, scene => 10000};
get(1994) ->
    #{id => 1994, name => <<"葛荣">>, scene => 10000};
get(1995) ->
    #{id => 1995, name => <<"余毒">>, scene => 10000};
get(1996) ->
    #{id => 1996, name => <<"喽啰">>, scene => 10000};
get(1997) ->
    #{id => 1997, name => <<"无量剑宗弟子">>, scene => 10002};
get(1998) ->
    #{id => 1998, name => <<"司空玄">>, scene => 10002};
get(1999) ->
    #{id => 1999, name => <<"左子穆">>, scene => 10001};
get(2001) ->
    #{id => 2001, name => <<"钱为一">>, scene => 40001};
get(2002) ->
    #{id => 2002, name => <<"李德宝">>, scene => 10006};
get(2003) ->
    #{id => 2003, name => <<"练功师">>, scene => 40001};
get(2004) ->
    #{id => 2004, name => <<"天元鼎">>, scene => 40001};
get(2005) ->
    #{id => 2005, name => <<"李德财">>, scene => 10008};
get(2006) ->
    #{id => 2006, name => <<"帮会车夫">>, scene => 40001};
get(2007) ->
    #{id => 2007, name => <<"吴维">>, scene => 40001};
get(2008) ->
    #{id => 2008, name => <<"程佰文">>, scene => 40001};
get(2009) ->
    #{id => 2009, name => <<"郑无名">>, scene => 40001};
get(2010) ->
    #{id => 2010, name => <<"赵启明">>, scene => 40001};
get(2011) ->
    #{id => 2011, name => <<"乐善">>, scene => 40001};
get(2012) ->
    #{id => 2012, name => <<"万藏宝">>, scene => 40001};
get(2013) ->
    #{id => 2013, name => <<"戴三金">>, scene => 40001};
get(2014) ->
    #{id => 2014, name => <<"段正淳">>, scene => 40001};
get(2101) ->
    #{id => 2101, name => <<"司仪">>, scene => 40013};
get(2102) ->
    #{id => 2102, name => <<"金童">>, scene => 40013};
get(2103) ->
    #{id => 2103, name => <<"玉女">>, scene => 40013};
get(2104) ->
    #{id => 2104, name => <<"薇娜">>, scene => 40013};
get(2105) ->
    #{id => 2105, name => <<"喜宴">>, scene => 40013};
get(2106) ->
    #{id => 2106, name => <<"喜宴">>, scene => 40013};
get(2107) ->
    #{id => 2107, name => <<"喜宴">>, scene => 40013};
get(2108) ->
    #{id => 2108, name => <<"喜宴">>, scene => 40013};
get(2109) ->
    #{id => 2109, name => <<"喜宴">>, scene => 40013};
get(2110) ->
    #{id => 2110, name => <<"喜宴">>, scene => 40013};
get(3011) ->
    #{id => 3011, name => <<"马贼张五">>, scene => 10002};
get(3012) ->
    #{id => 3012, name => <<"马贼王二">>, scene => 10002};
get(3013) ->
    #{id => 3013, name => <<"马贼郭宵">>, scene => 10002};
get(3014) ->
    #{id => 3014, name => <<"马贼刘申">>, scene => 10002};
get(3015) ->
    #{id => 3015, name => <<"马贼刘申">>, scene => 10002};
get(3021) ->
    #{id => 3021, name => <<"马贼宋姜">>, scene => 10004};
get(3022) ->
    #{id => 3022, name => <<"马贼伍庸">>, scene => 10004};
get(3023) ->
    #{id => 3023, name => <<"马贼鹿君逸">>, scene => 10004};
get(3024) ->
    #{id => 3024, name => <<"马贼林崇">>, scene => 10004};
get(3025) ->
    #{id => 3025, name => <<"马贼李魁">>, scene => 10004};
get(3031) ->
    #{id => 3031, name => <<"马贼公孙省">>, scene => 10006};
get(3032) ->
    #{id => 3032, name => <<"马贼管盛">>, scene => 10006};
get(3033) ->
    #{id => 3033, name => <<"马贼秦冥">>, scene => 10006};
get(3034) ->
    #{id => 3034, name => <<"马贼胡彦灼">>, scene => 10006};
get(3035) ->
    #{id => 3035, name => <<"马贼华容">>, scene => 10006};
get(3041) ->
    #{id => 3041, name => <<"马贼蔡进">>, scene => 10008};
get(3042) ->
    #{id => 3042, name => <<"马贼李英">>, scene => 10008};
get(3043) ->
    #{id => 3043, name => <<"马贼祝仝">>, scene => 10008};
get(3044) ->
    #{id => 3044, name => <<"马贼卢至深">>, scene => 10008};
get(3045) ->
    #{id => 3045, name => <<"马贼伍松">>, scene => 10008};
get(3051) ->
    #{id => 3051, name => <<"马贼董萍">>, scene => 10010};
get(3052) ->
    #{id => 3052, name => <<"马贼张青">>, scene => 10010};
get(3053) ->
    #{id => 3053, name => <<"马贼杨智">>, scene => 10010};
get(3054) ->
    #{id => 3054, name => <<"马贼许宁">>, scene => 10010};
get(3055) ->
    #{id => 3055, name => <<"马贼索抄">>, scene => 10010};
get(3061) ->
    #{id => 3061, name => <<"马贼玳宗">>, scene => 10011};
get(3062) ->
    #{id => 3062, name => <<"马贼柳唐">>, scene => 10011};
get(3063) ->
    #{id => 3063, name => <<"马贼石进">>, scene => 10011};
get(3064) ->
    #{id => 3064, name => <<"马贼沐虹">>, scene => 10011};
get(3065) ->
    #{id => 3065, name => <<"马贼雷恒">>, scene => 10011};
get(3071) ->
    #{id => 3071, name => <<"马贼李骏">>, scene => 10012};
get(3072) ->
    #{id => 3072, name => <<"马贼阮贰">>, scene => 10012};
get(3073) ->
    #{id => 3073, name => <<"马贼张衡">>, scene => 10012};
get(3074) ->
    #{id => 3074, name => <<"马贼阮伍">>, scene => 10012};
get(3075) ->
    #{id => 3075, name => <<"马贼张瞬">>, scene => 10012};
get(4001) ->
    #{id => 4001, name => <<"赵都头">>, scene => 10006};
get(4002) ->
    #{id => 4002, name => <<"钱都头">>, scene => 10006};
get(4003) ->
    #{id => 4003, name => <<"孙捕头">>, scene => 10006};
get(4004) ->
    #{id => 4004, name => <<"李捕头">>, scene => 10006};
get(4005) ->
    #{id => 4005, name => <<"周捕头">>, scene => 10006};
get(4006) ->
    #{id => 4006, name => <<"云中鹤">>, scene => 10006};
get(4007) ->
    #{id => 4007, name => <<"岳老三">>, scene => 10006};
get(4008) ->
    #{id => 4008, name => <<"叶二娘">>, scene => 10006};
get(4009) ->
    #{id => 4009, name => <<"段延庆">>, scene => 10006};
get(4010) ->
    #{id => 4010, name => <<"鸠摩智">>, scene => 10006};
get(4100) ->
    #{id => 4100, name => <<"江湖百晓生">>, scene => 40012};
get(4501) ->
    #{id => 4501, name => <<"丐帮大师兄">>, scene => 10000};
get(4502) ->
    #{id => 4502, name => <<"逍遥大师兄">>, scene => 10000};
get(4503) ->
    #{id => 4503, name => <<"峨眉大师姐">>, scene => 10000};
get(4504) ->
    #{id => 4504, name => <<"天山大师姐">>, scene => 10000};
get(_Npc) ->
    #{id => 0, name => <<"">>, scene => 0}.
