%% -*- coding: latin-1 -*-
%%------------------------------------------------------------------------------
%% @File   : conf_currency
%% @Brief  : 货币类型
%% @Author : Ryuu
%%------------------------------------------------------------------------------
-module(conf_currency).

-export([
    get/1,
    get_ids/0
]).

get(1) ->
    #{
        id => 1,
        name => <<"经验">>,
        type => 0,
        goods => 16160101        
    };
get(2) ->
    #{
        id => 2,
        name => <<"元宝">>,
        type => 0,
        goods => 16160102        
    };
get(3) ->
    #{
        id => 3,
        name => <<"绑元">>,
        type => 0,
        goods => 16160103        
    };
get(4) ->
    #{
        id => 4,
        name => <<"铜钱">>,
        type => 0,
        goods => 16160104        
    };
get(5) ->
    #{
        id => 5,
        name => <<"道具">>,
        type => 0,
        goods => 16160105        
    };
get(9) ->
    #{
        id => 9,
        name => <<"友情币">>,
        type => 0,
        goods => 16160106        
    };
get(10) ->
    #{
        id => 10,
        name => <<"帮会贡献">>,
        type => 0,
        goods => 16160107        
    };
get(11) ->
    #{
        id => 11,
        name => <<"声望">>,
        type => 0,
        goods => 16160108        
    };
get(12) ->
    #{
        id => 12,
        name => <<"帮会通宝">>,
        type => 0,
        goods => 16160109        
    };
get(13) ->
    #{
        id => 13,
        name => <<"绑元优先">>,
        type => 0,
        goods => 16160110        
    };
get(14) ->
    #{
        id => 14,
        name => <<"打造积分">>,
        type => 0,
        goods => 16160111        
    };
get(15) ->
    #{
        id => 15,
        name => <<"百炼精华">>,
        type => 0,
        goods => 16160112        
    };
get(16) ->
    #{
        id => 16,
        name => <<"侠义值">>,
        type => 0,
        goods => 16160113        
    };
get(17) ->
    #{
        id => 17,
        name => <<"银两">>,
        type => 0,
        goods => 16160115        
    };
get(18) ->
    #{
        id => 18,
        name => <<"储备元宝">>,
        type => 0,
        goods => 16160116        
    };
get(19) ->
    #{
        id => 19,
        name => <<"许愿果">>,
        type => 0,
        goods => 16160117        
    };
get(20) ->
    #{
        id => 20,
        name => <<"宝珠">>,
        type => 0,
        goods => 16160118        
    };
get(21) ->
    #{
        id => 21,
        name => <<"积分">>,
        type => 0,
        goods => 16160119        
    };
get(22) ->
    #{
        id => 22,
        name => <<"桃李值">>,
        type => 0,
        goods => 16160120        
    };
get(23) ->
    #{
        id => 23,
        name => <<"历史恩爱值">>,
        type => 0,
        goods => 16160121        
    };
get(24) ->
    #{
        id => 24,
        name => <<"天命印记">>,
        type => 0,
        goods => 16160122        
    };
get(25) ->
    #{
        id => 25,
        name => <<"储备元宝优先">>,
        type => 0,
        goods => 16160116        
    };
get(_ID) ->
    undefined.

get_ids() ->
    [1, 2, 3, 4, 5, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25].
