%% -*- coding: latin-1 -*-
%%------------------------------------------------------------------------------
%% @File   : conf_guild_pos
%% @Brief  : 帮派职位
%% @Author : Ryuu
%%------------------------------------------------------------------------------
-module(conf_guild_pos).

-export([
    get/2,
    get_ids/1
]).

get(1, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(1, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 4        
    };
get(1, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 2        
    };
get(1, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(1, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(2, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(2, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 6        
    };
get(2, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 3        
    };
get(2, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(2, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(3, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(3, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(3, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 3        
    };
get(3, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(3, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(4, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(4, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(4, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(4, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(4, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(5, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(5, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(5, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(5, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(5, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(6, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(6, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(6, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(6, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(6, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(7, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(7, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(7, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(7, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(7, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(8, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(8, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(8, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(8, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(8, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(9, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(9, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(9, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(9, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(9, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(10, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(10, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(10, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(10, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(10, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(11, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(11, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(11, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(11, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(11, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(12, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(12, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(12, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(12, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(12, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(13, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(13, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(13, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(13, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(13, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(14, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(14, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(14, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(14, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(14, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(15, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(15, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(15, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(15, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(15, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(16, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(16, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(16, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(16, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(16, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(17, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(17, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(17, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(17, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(17, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(18, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(18, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(18, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(18, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(18, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(19, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(19, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(19, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(19, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(19, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(20, 1) ->
    #{
        pos => 1,
        name => <<"帮众">>,
        num => 9999        
    };
get(20, 2) ->
    #{
        pos => 2,
        name => <<"精英">>,
        num => 8        
    };
get(20, 3) ->
    #{
        pos => 3,
        name => <<"长老">>,
        num => 4        
    };
get(20, 4) ->
    #{
        pos => 4,
        name => <<"副帮主">>,
        num => 2        
    };
get(20, 5) ->
    #{
        pos => 5,
        name => <<"帮主">>,
        num => 1        
    };
get(_Level, _Pos) ->
    undefined.

get_ids(1) ->
    [1, 2, 3, 4, 5];
get_ids(2) ->
    [1, 2, 3, 4, 5];
get_ids(3) ->
    [1, 2, 3, 4, 5];
get_ids(4) ->
    [1, 2, 3, 4, 5];
get_ids(5) ->
    [1, 2, 3, 4, 5];
get_ids(6) ->
    [1, 2, 3, 4, 5];
get_ids(7) ->
    [1, 2, 3, 4, 5];
get_ids(8) ->
    [1, 2, 3, 4, 5];
get_ids(9) ->
    [1, 2, 3, 4, 5];
get_ids(10) ->
    [1, 2, 3, 4, 5];
get_ids(11) ->
    [1, 2, 3, 4, 5];
get_ids(12) ->
    [1, 2, 3, 4, 5];
get_ids(13) ->
    [1, 2, 3, 4, 5];
get_ids(14) ->
    [1, 2, 3, 4, 5];
get_ids(15) ->
    [1, 2, 3, 4, 5];
get_ids(16) ->
    [1, 2, 3, 4, 5];
get_ids(17) ->
    [1, 2, 3, 4, 5];
get_ids(18) ->
    [1, 2, 3, 4, 5];
get_ids(19) ->
    [1, 2, 3, 4, 5];
get_ids(20) ->
    [1, 2, 3, 4, 5];
get_ids(_) ->
    [].