%% -*- coding: latin-1 -*-
%%------------------------------------------------------------------------------
%% @File   : conf_kill_mon_exp_info
%% @Brief  : 江湖历练
%% @Author : LW
%%------------------------------------------------------------------------------
-module(conf_kill_mon_exp_info).

-export([
    get/0
]).

get() ->
    #{
        item_id => 16320001,
        daily_add_times => 3,
        max_times => 9,
        daily_use_times => 9,
        kill_num => [{0,3000,100},{3000, -1, 10}],
        level_effect => [{-999,-20,50},{-19,-10,75},{-9,5,100},{6,15,75},{16,-1,50}]
    }.
