%% -*- coding: latin-1 -*-
%%------------------------------------------------------------------------------
%% @File   : conf_questionnaire
%% @Brief  : 意见反馈
%% @Author : LW
%%------------------------------------------------------------------------------
-module(conf_questionnaire).

-export([
    get/1,
    get_ids/0
]).

get(1) ->
    #{
        id => 1,
        reward => 297001,
        start_time => {{2019,1,21},{0,0,0}},
        end_time => {{2019,3,20},{23,59,59}}        
    };
get(2) ->
    #{
        id => 2,
        reward => 297001,
        start_time => {{2019,3,21},{0,0,0}},
        end_time => {{2020,3,21},{23,59,59}}        
    };
get(_ID) ->
    undefined.

get_ids() ->
    [1, 2].
