%% -*- coding: latin-1 -*-
%%------------------------------------------------------------------------------
%% @File   : conf_anqi_model
%% @Brief  : 暗器基础模型
%% @Author : Tom
%%------------------------------------------------------------------------------
-module(conf_anqi_model).

-export([
    get/1
]).

get(1) ->
    #{
        name => "飞蝗石",
        lv => 64,
        forge_lv => 1,
        quality => [2],
        star => [3],
        level_max => 600,
        attr => [{5,115},{6,115}],
        forge_attr => [{101,43},{102,43},{103,43},{104,43},{105,23}],
        forge_source => [{16420101,100}]
        
    };
get(2) ->
    #{
        name => "梅花镖",
        lv => 74,
        forge_lv => 2,
        quality => [3],
        star => [5],
        level_max => 1000,
        attr => [{5,258},{6,258}],
        forge_attr => [{101,74},{102,74},{103,74},{104,74},{105,41}],
        forge_source => [{16420101,100}]
        
    };
get(3) ->
    #{
        name => "冰魄神针",
        lv => 84,
        forge_lv => 3,
        quality => [4],
        star => [7],
        level_max => 3000,
        attr => [{5,388},{6,388}],
        forge_attr => [{101,110},{102,110},{103,110},{104,110},{105,61}],
        forge_source => [{16420102,300}]
        
    };
get(4) ->
    #{
        name => "金翅翎羽",
        lv => 94,
        forge_lv => 4,
        quality => [5],
        star => [9],
        level_max => 5000,
        attr => [{5,517},{6,517}],
        forge_attr => [{101,149},{102,149},{103,149},{104,149},{105,82}],
        forge_source => [{16420103,300}]
        
    };
get(5) ->
    #{
        name => "暴雨梨花针",
        lv => 94,
        forge_lv => 5,
        quality => [5],
        star => [9],
        level_max => 7000,
        attr => [{5,689},{6,689}],
        forge_attr => [{101,200},{102,200},{103,200},{104,200},{105,111}],
        forge_source => [{16420104,100}]
        
    };
get(6) ->
    #{
        name => "孔雀翎",
        lv => 94,
        forge_lv => 6,
        quality => [5],
        star => [9],
        level_max => 8500,
        attr => [{5,721},{6,721}],
        forge_attr => [{101,317},{102,317},{103,317},{104,317},{105,176}],
        forge_source => [{16420105,300}]
        
    };
get(_Id) ->
    undefined.