%% -*- coding: latin-1 -*-
%%------------------------------------------------------------------------------
%% @File   : conf_career_battle_times
%% @Brief  : 门派竞技场次奖励
%% @Author : LW
%%------------------------------------------------------------------------------
-module(conf_career_battle_times).

-export([
    get/2,
    get_grade_times/1
]).

get(1, 1) -> 132001;
get(1, 3) -> 132002;
get(1, 6) -> 132003;
get(1, 9) -> 132004;
get(2, 1) -> 132101;
get(2, 3) -> 132102;
get(2, 6) -> 132103;
get(2, 9) -> 132104;
get(3, 1) -> 132201;
get(3, 3) -> 132202;
get(3, 6) -> 132203;
get(3, 9) -> 132204;
get(4, 1) -> 132301;
get(4, 3) -> 132302;
get(4, 6) -> 132303;
get(4, 9) -> 132304;
get(_Grade, _Times) -> 0.

get_grade_times(1) ->
    [1, 3, 6, 9];
get_grade_times(2) ->
    [1, 3, 6, 9];
get_grade_times(3) ->
    [1, 3, 6, 9];
get_grade_times(4) ->
    [1, 3, 6, 9];
get_grade_times(_) ->
    [].