%% -*- coding: latin-1 -*-
%%------------------------------------------------------------------------------
%% @File   : conf_daily_thief
%% @Brief  : 马贼任务
%% @Author : LW
%%------------------------------------------------------------------------------
-module(conf_daily_thief).

-export([
    get/0
]).

get() ->
    #{
        team_min_role => 2,
        open_lv => 20,
        one_round_times => 15,
        mul_reward_times => 15,
        thief_reward_times => 1,
        npc_pos => [{1,29,[3021,3022,3023,3024,3025]},{30,39,[3031,3032,3033,3034,3035]},{40,49,[3041,3042,3043,3044,3045]},{50,59,[3051,3052,3053,3054,3055]},{60,69,[3061,3062,3063,3064,3065]},{70,-1,[3071,3072,3073,3074,3075]}],
        adventure_mon_weight => 900,
        adventure_roraty_weight => 900,
        exp_last_time => 300,
        roraty_last_time => 300    }.
