%% -*- coding: latin-1 -*-
%%----------------------------------
%% Statements:
%% @module      场景配置表
%% @author      cablsbs
%%----------------------------------
-module(conf_scene).

-include("log.hrl").

-export([
    get/1,
    get_all_id/0,
    get_ids_by_type/1,
    get_active_scene_ids/1,
    get_correct_scene/1,
    get_extra_conf/1,
    get_name/1
]).


%% @doc 获取场景配置
%% @spec get(SceneId) -> #scene{} | undefined.
%% SceneId     :: integer()
get(10000) ->
    conf_scene_10000:get();
get(10001) ->
    conf_scene_10001:get();
get(10002) ->
    conf_scene_10002:get();
get(10003) ->
    conf_scene_10003:get();
get(10004) ->
    conf_scene_10004:get();
get(10005) ->
    conf_scene_10005:get();
get(10006) ->
    conf_scene_10006:get();
get(10007) ->
    conf_scene_10007:get();
get(10008) ->
    conf_scene_10008:get();
get(10009) ->
    conf_scene_10009:get();
get(10010) ->
    conf_scene_10010:get();
get(10011) ->
    conf_scene_10011:get();
get(10012) ->
    conf_scene_10012:get();
get(10013) ->
    conf_scene_10013:get();
get(10014) ->
    conf_scene_10014:get();
get(11000) ->
    conf_scene_11000:get();
get(11001) ->
    conf_scene_11001:get();
get(20001) ->
    conf_scene_20001:get();
get(20002) ->
    conf_scene_20002:get();
get(20003) ->
    conf_scene_20003:get();
get(20004) ->
    conf_scene_20004:get();
get(20005) ->
    conf_scene_20005:get();
get(20006) ->
    conf_scene_20006:get();
get(20007) ->
    conf_scene_20007:get();
get(20008) ->
    conf_scene_20008:get();
get(20009) ->
    conf_scene_20009:get();
get(20010) ->
    conf_scene_20010:get();
get(20011) ->
    conf_scene_20011:get();
get(20012) ->
    conf_scene_20012:get();
get(20013) ->
    conf_scene_20013:get();
get(20014) ->
    conf_scene_20014:get();
get(20015) ->
    conf_scene_20015:get();
get(20016) ->
    conf_scene_20016:get();
get(20017) ->
    conf_scene_20017:get();
get(20018) ->
    conf_scene_20018:get();
get(20019) ->
    conf_scene_20019:get();
get(20020) ->
    conf_scene_20020:get();
get(20021) ->
    conf_scene_20021:get();
get(20022) ->
    conf_scene_20022:get();
get(20023) ->
    conf_scene_20023:get();
get(20024) ->
    conf_scene_20024:get();
get(20025) ->
    conf_scene_20025:get();
get(20026) ->
    conf_scene_20026:get();
get(20027) ->
    conf_scene_20027:get();
get(20028) ->
    conf_scene_20028:get();
get(20029) ->
    conf_scene_20029:get();
get(20030) ->
    conf_scene_20030:get();
get(30001) ->
    conf_scene_30001:get();
get(30002) ->
    conf_scene_30002:get();
get(30003) ->
    conf_scene_30003:get();
get(30004) ->
    conf_scene_30004:get();
get(30005) ->
    conf_scene_30005:get();
get(30006) ->
    conf_scene_30006:get();
get(30007) ->
    conf_scene_30007:get();
get(30008) ->
    conf_scene_30008:get();
get(30009) ->
    conf_scene_30009:get();
get(30011) ->
    conf_scene_30011:get();
get(30012) ->
    conf_scene_30012:get();
get(30013) ->
    conf_scene_30013:get();
get(30014) ->
    conf_scene_30014:get();
get(31001) ->
    conf_scene_31001:get();
get(31002) ->
    conf_scene_31002:get();
get(31003) ->
    conf_scene_31003:get();
get(31004) ->
    conf_scene_31004:get();
get(31005) ->
    conf_scene_31005:get();
get(31006) ->
    conf_scene_31006:get();
get(40001) ->
    conf_scene_40001:get();
get(40002) ->
    conf_scene_40002:get();
get(40003) ->
    conf_scene_40003:get();
get(40004) ->
    conf_scene_40004:get();
get(40005) ->
    conf_scene_40005:get();
get(40006) ->
    conf_scene_40006:get();
get(40007) ->
    conf_scene_40007:get();
get(40008) ->
    conf_scene_40008:get();
get(40009) ->
    conf_scene_40009:get();
get(40010) ->
    conf_scene_40010:get();
get(40011) ->
    conf_scene_40011:get();
get(40012) ->
    conf_scene_40012:get();
get(40013) ->
    conf_scene_40013:get();
get(40014) ->
    conf_scene_40014:get();
get(50001) ->
    conf_scene_50001:get();
get(50002) ->
    conf_scene_50002:get();
get(50003) ->
    conf_scene_50003:get();
get(50004) ->
    conf_scene_50004:get();
get(50005) ->
    conf_scene_50005:get();
get(50006) ->
    conf_scene_50006:get();
get(50007) ->
    conf_scene_50007:get();
get(50008) ->
    conf_scene_50008:get();
get(50009) ->
    conf_scene_50009:get();
get(50010) ->
    conf_scene_50010:get();
get(60001) ->
    conf_scene_60001:get();
get(70001) ->
    conf_scene_70001:get();
get(70002) ->
    conf_scene_70002:get();
get(70003) ->
    conf_scene_70003:get();
get(70004) ->
    conf_scene_70004:get();
get(70005) ->
    conf_scene_70005:get();
get(70101) ->
    conf_scene_70101:get();
get(70102) ->
    conf_scene_70102:get();
get(70103) ->
    conf_scene_70103:get();
get(70104) ->
    conf_scene_70104:get();
get(70105) ->
    conf_scene_70105:get();
get(71001) ->
    conf_scene_71001:get();
get(SceneId) ->
    ?ERROR_FUNC_CALL([SceneId]),
    undefined.


%% @doc 获取所有场景id列表
%% @spec get_all_id() -> [SceneId].
%% SceneId      :: integer()
get_all_id() ->
    [10000, 10001, 10002, 10003, 10004, 10005, 10006, 10007, 10008, 10009, 10010, 10011, 10012, 10013, 10014, 11000, 11001, 20001, 20002, 20003, 20004, 20005, 20006, 20007, 20008, 20009, 20010, 20011, 20012, 20013, 20014, 20015, 20016, 20017, 20018, 20019, 20020, 20021, 20022, 20023, 20024, 20025, 20026, 20027, 20028, 20029, 20030, 30001, 30002, 30003, 30004, 30005, 30006, 30007, 30008, 30009, 30011, 30012, 30013, 30014, 31001, 31002, 31003, 31004, 31005, 31006, 40001, 40002, 40003, 40004, 40005, 40006, 40007, 40008, 40009, 40010, 40011, 40012, 40013, 40014, 50001, 50002, 50003, 50004, 50005, 50006, 50007, 50008, 50009, 50010, 60001, 70001, 70002, 70003, 70004, 70005, 70101, 70102, 70103, 70104, 70105, 71001].


%% @doc 获取某类型场景id列表
%% @spec get_ids_by_type(SceneType) -> [SceneId].
%% SceneType = SceneId      :: integer()
get_ids_by_type(1) ->
    [10000, 60001];
get_ids_by_type(2) ->
    [10001, 10002, 10003, 10004, 10005, 10006, 10007, 10008, 10009, 10010, 10011, 10012, 10013, 10014, 20002, 40002, 40008, 40011, 70001, 70002, 70003, 70004, 70005, 70101, 70102, 70103, 70104, 70105];
get_ids_by_type(4) ->
    [11000, 11001];
get_ids_by_type(6) ->
    [20001, 40004];
get_ids_by_type(105) ->
    [20003, 20004, 20021, 20022, 20023, 20024, 20025, 20026, 20027, 20028, 20029, 20030];
get_ids_by_type(10) ->
    [20005, 40007];
get_ids_by_type(5) ->
    [20006, 20007, 20008, 20009, 20010, 20011, 20012, 20013, 20014, 20015, 20016, 20017, 20018, 20019, 20020, 40003, 40005, 40006, 40009, 40010, 40013, 50001, 50002, 50003, 50004, 50005, 50006, 50007, 50008, 50009, 50010];
get_ids_by_type(3) ->
    [30001, 30002, 30003, 30004, 30005, 30006, 30007, 30008, 30009, 30011, 30012, 30013, 30014, 31001, 31002, 31003, 31004, 31005, 31006, 40012, 40014, 71001];
get_ids_by_type(7) ->
    [40001];
get_ids_by_type(_Type) ->
    [].


%% @doc 获取开服启动场景id列表
%% @spec get_active_scene_ids(NodeId) -> [SceneId].
%% NodeId       :: integer()
%% SceneId      :: integer()
get_active_scene_ids(10) ->
    [10000, 60001, 10001, 10002, 10003, 10004, 10005, 10006, 10007, 10008, 10009, 10010, 10011, 10012, 10013, 10014, 20002, 40002, 40008, 40011, 70001, 70002, 70003, 70004, 70005, 70101, 70102, 70103, 70104, 70105, 11000, 11001];
get_active_scene_ids(NodeId) when NodeId >= 300 ->
    [20026,20027,20028,20029, 20030];
get_active_scene_ids(_NodeId) ->
    [].


%% @doc 获取重置场景配置
%% @spec get_correct_scene(Level) -> {SceneId, X, Y}.
%% SceneType = SceneId      :: integer()
get_correct_scene(Level) when Level >= 10 ->
    {10000, 224, 256};
get_correct_scene(Level) when Level >= 1 ->
    {10001, 427, 88};
get_correct_scene(_Level) ->
    {10001, 427, 88}.


%% @doc 获取额外配置
%% @spec get_extra_conf(SceneId) -> {IsBcastMon, IsBroadcast, ReviveType, ReviveParam, ReviveRecover}.
%% SceneId                                  :: integer()
%% IsBcastMon = IsBroadcast = ReviveType    :: integer()
%% ReviveParam                              :: []
%% ReviveRecover                            :: {HpRate, MpRate}
get_extra_conf(10000) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10001) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10002) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10003) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10004) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10005) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10006) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10007) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10008) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10009) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10010) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10011) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10012) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10013) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(10014) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(11000) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(11001) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(20001) -> {1, 0, 4, [{1,0},{2,5}], {10000,10000}};
get_extra_conf(20002) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20003) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20004) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20005) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20006) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20007) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20008) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20009) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20010) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20011) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20012) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20013) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20014) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20015) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20016) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20017) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20018) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20019) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20020) -> {1, 0, 8, [{1,1},{2,5}], {10000,10000}};
get_extra_conf(20021) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20022) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20023) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20024) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20025) -> {1, 0, 20, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(20026) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20027) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20028) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20029) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(20030) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(30001) -> {1, 0, 34, [{1,1},{2,30}], {8000,8000}};
get_extra_conf(30002) -> {1, 0, 34, [{1,1},{2,30}], {6000,6000}};
get_extra_conf(30003) -> {1, 0, 34, [{1,1},{2,30}], {3000,3000}};
get_extra_conf(30004) -> {1, 0, 34, [{1,1},{2,30}], {3000,3000}};
get_extra_conf(30005) -> {1, 0, 34, [{1,1},{2,30}], {3000,3000}};
get_extra_conf(30006) -> {1, 0, 34, [{1,1},{2,30}], {3000,3000}};
get_extra_conf(30007) -> {1, 0, 34, [{1,1},{2,30}], {3000,3000}};
get_extra_conf(30008) -> {1, 0, 34, [{1,1},{2,30}], {3000,3000}};
get_extra_conf(30009) -> {1, 0, 34, [{1,1},{2,30}], {3000,3000}};
get_extra_conf(30011) -> {1, 0, 34, [{1,1},{2,30}], {8000,8000}};
get_extra_conf(30012) -> {1, 0, 34, [{1,1},{2,30}], {6000,6000}};
get_extra_conf(30013) -> {1, 0, 34, [{1,1},{2,30}], {3000,3000}};
get_extra_conf(30014) -> {1, 0, 34, [{1,1},{2,30}], {3000,3000}};
get_extra_conf(31001) -> {1, 0, 2, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(31002) -> {1, 0, 2, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(31003) -> {1, 0, 2, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(31004) -> {1, 0, 2, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(31005) -> {1, 0, 2, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(31006) -> {1, 0, 2, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(40001) -> {1, 0, 0, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(40002) -> {1, 0, 0, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(40003) -> {1, 0, 4, [{1,0},{2,5}], {10000,10000}};
get_extra_conf(40004) -> {1, 0, 4, [{1,0},{2,5}], {10000,10000}};
get_extra_conf(40005) -> {1, 0, 2, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(40006) -> {1, 0, 8, [{1,0},{2,15}], {10000,10000}};
get_extra_conf(40007) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(40008) -> {1, 0, 0, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(40009) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(40010) -> {1, 0, 2, [{1,0},{2,15}], {10000,10000}};
get_extra_conf(40011) -> {1, 0, 0, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(40012) -> {1, 0, 4, [{1,1},{2,10}], {10000,10000}};
get_extra_conf(40013) -> {1, 0, 0, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(40014) -> {1, 0, 4, [{1,1},{2,10}], {10000,10000}};
get_extra_conf(50001) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(50002) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(50003) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(50004) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(50005) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(50006) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(50007) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(50008) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(50009) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(50010) -> {1, 0, 2, [{1,0},{2,10}], {10000,10000}};
get_extra_conf(60001) -> {1, 0, 0, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(70001) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(70002) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(70003) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(70004) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(70005) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(70101) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(70102) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(70103) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(70104) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(70105) -> {1, 0, 32, [{1,1},{2,30},{4,0}], {10000,10000}};
get_extra_conf(71001) -> {1, 0, 2, [{1,1},{2,30}], {10000,10000}};
get_extra_conf(_SceneId) -> {0, 0, 0, [], {0, 0}}.


%% @doc 获取场景名(查询用)
get_name(10000) -> "洛阳";
get_name(10001) -> "琅嬛福地";
get_name(10002) -> "无量剑派";
get_name(10003) -> "苏州郊外（废弃）";
get_name(10004) -> "聚贤庄";
get_name(10005) -> "燕王古墓";
get_name(10006) -> "天龙寺";
get_name(10007) -> "秦皇地宫";
get_name(10008) -> "燕子坞";
get_name(10009) -> "镜湖";
get_name(10010) -> "夜西湖";
get_name(10011) -> "擂鼓山";
get_name(10012) -> "缥缈峰";
get_name(10013) -> "少室山";
get_name(10014) -> "无量剑派（废弃）";
get_name(11000) -> "监狱";
get_name(11001) -> "地府";
get_name(20001) -> "竞技场";
get_name(20002) -> "领地战";
get_name(20003) -> "宋辽战场";
get_name(20004) -> "宋辽休息室";
get_name(20005) -> "演武堂休息室";
get_name(20006) -> "开门战场";
get_name(20007) -> "休门战场";
get_name(20008) -> "生门战场";
get_name(20009) -> "伤门战场";
get_name(20010) -> "杜门战场";
get_name(20011) -> "景门战场";
get_name(20012) -> "死门战场";
get_name(20013) -> "惊门战场";
get_name(20014) -> "青龙战场";
get_name(20015) -> "朱雀战场";
get_name(20016) -> "白虎战场";
get_name(20017) -> "玄武战场";
get_name(20018) -> "阴战场";
get_name(20019) -> "阳战场";
get_name(20020) -> "混沌战场";
get_name(20021) -> "青铜休息室";
get_name(20022) -> "白银休息室";
get_name(20023) -> "黄金休息室";
get_name(20024) -> "钻石休息室";
get_name(20025) -> "秦皇陵";
get_name(20026) -> "青铜休息室";
get_name(20027) -> "白银休息室";
get_name(20028) -> "黄金休息室";
get_name(20029) -> "钻石休息室";
get_name(20030) -> "宋辽战场";
get_name(30001) -> "老三环";
get_name(30002) -> "燕子坞";
get_name(30003) -> "四绝庄";
get_name(30004) -> "缥缈峰";
get_name(30005) -> "珍珑棋局";
get_name(30006) -> "少室山-鸠摩智";
get_name(30007) -> "少室山-庄聚贤";
get_name(30008) -> "少室山-慕容复";
get_name(30009) -> "少室山-丁春秋";
get_name(30011) -> "英雄老三环";
get_name(30012) -> "英雄燕子坞";
get_name(30013) -> "英雄四绝庄";
get_name(30014) -> "英雄缥缈峰";
get_name(31001) -> "琅嬛福地";
get_name(31002) -> "老三环";
get_name(31003) -> "琅嬛福地";
get_name(31004) -> "无量剑派";
get_name(31005) -> "珍珑棋局";
get_name(31006) -> "无量剑派";
get_name(40001) -> "帮会领地";
get_name(40002) -> "运镖地图";
get_name(40003) -> "武林盟主";
get_name(40004) -> "武林盟主";
get_name(40005) -> "帮会守卫战";
get_name(40006) -> "门派竞技";
get_name(40007) -> "门派竞技休息室";
get_name(40008) -> "镜湖剿匪";
get_name(40009) -> "领地休息室";
get_name(40010) -> "领地战";
get_name(40011) -> "玄武岛";
get_name(40012) -> "英雄试炼";
get_name(40013) -> "结婚礼堂";
get_name(40014) -> "江湖";
get_name(50001) -> "武林禁地";
get_name(50002) -> "武林禁地";
get_name(50003) -> "武林禁地";
get_name(50004) -> "武林禁地";
get_name(50005) -> "武林禁地";
get_name(50006) -> "武林禁地";
get_name(50007) -> "武林禁地";
get_name(50008) -> "武林禁地";
get_name(50009) -> "武林禁地";
get_name(50010) -> "武林禁地";
get_name(60001) -> "创角-天山";
get_name(70001) -> "秦皇地宫一层";
get_name(70002) -> "秦皇地宫二层";
get_name(70003) -> "秦皇地宫三层";
get_name(70004) -> "秦皇地宫四层";
get_name(70005) -> "秦皇地宫五层";
get_name(70101) -> "燕王古墓一层";
get_name(70102) -> "燕王古墓二层";
get_name(70103) -> "燕王古墓三层";
get_name(70104) -> "燕王古墓四层";
get_name(70105) -> "燕王古墓五层";
get_name(71001) -> "藏宝洞";
get_name(_SceneId) -> "".


