%% -*- coding: latin-1 -*-
%%------------------------------------------------------------------------------
%% @File   : conf_mail_template
%% @Brief  : 郵件模板
%% @Author : Ryuu
%%------------------------------------------------------------------------------
-module(conf_mail_template).

-export([
    get/1,
    get_ids/0
]).

get(1) ->
    #{
        id => 1,
        title => <<"測試郵件">>,
        content => <<"あなたは誰？">>
    };
get(2) ->
    #{
        id => 2,
        title => <<"測試活動2">>,
        content => <<"1">>
    };
get(3) ->
    #{
        id => 3,
        title => <<"禁言提醒">>,
        content => <<"很抱歉，您聊天中連續多次發送敏感內容，暫時被禁言至~w年~w月~w日~w時~w分~w秒。請配合營造和諧聊天氛圍，如有疑問，請聯系遊戲客服。">>
    };
get(11) ->
    #{
        id => 11,
        title => <<"競技場冠軍">>,
        content => <<"恭喜妳獲得今日江湖競技<font color=\"#5fc934\">冠軍</font>，獲得大量獎勵，請查收">>
    };
get(12) ->
    #{
        id => 12,
        title => <<"競技場獎勵">>,
        content => <<"恭喜妳在今日江湖競技中排名<font color=\"#5fc934\">第~w名</font>，獲得大量獎勵，請查收">>
    };
get(21) ->
    #{
        id => 21,
        title => <<"奪寶奇兵">>,
        content => <<"恭喜妳對<font color=\"#5fc934\">~s</font>的擊殺中做出卓越貢獻，排名第<font color=\"#5fc934\">~w</font>，獲得以下獎勵，請查收">>
    };
get(31) ->
    #{
        id => 31,
        title => <<"充值成功">>,
        content => <<"恭喜您，您於<font color=\"#5fc934\">~w</font>年<font color=\"#5fc934\">~w</font>月<font color=\"#5fc934\">~w</font>日<font color=\"#5fc934\">~w</font>時<font color=\"#5fc934\">~w</font>分充值的[<font color=\"#fea21e\">~w元寶</font>]已成功註入。">>
    };
get(32) ->
    #{
        id => 32,
        title => <<"充值特惠">>,
        content => <<"恭喜您，您於<font color=\"#5fc934\">~w</font>年<font color=\"#5fc934\">~w</font>月<font color=\"#5fc934\">~w</font>日<font color=\"#5fc934\">~w</font>時<font color=\"#5fc934\">~w</font>分充值的[<font color=\"#fea21e\">~w元寶</font>]已成功註入。其中包含充值返利活動贈送的[<font color=\"#fea21e\">~w元寶</font>]。">>
    };
get(100) ->
    #{
        id => 100,
        title => <<"幫主替換">>,
        content => <<"您所在幫會原幫主<font color=\"#5fc934\">~s</font>疏於管理，已被彈劾下臺，更換了新幫主<font color=\"#5fc934\">~s</font>">>
    };
get(101) ->
    #{
        id => 101,
        title => <<"加入幫會">>,
        content => <<"您成功加入了幫會<font color=\"#5fc934\">~s</font>">>
    };
get(102) ->
    #{
        id => 102,
        title => <<"退出幫會">>,
        content => <<"您被請出了幫會<font color=\"#5fc934\">~s</font>">>
    };
get(103) ->
    #{
        id => 103,
        title => <<"幫會解散">>,
        content => <<"很遺憾，您所在幫會因為經營不善，缺乏幫會資金，已被自動解散。請您加入更活躍的幫會！">>
    };
get(104) ->
    #{
        id => 104,
        title => <<"幫主轉讓">>,
        content => <<"原幫主<font color=\"#5fc934\">~s</font>由於隱世閉關，將幫主之位傳於<font color=\"#5fc934\">~s</font>，希望新幫主能帶領壹眾兄弟闖出壹片新江湖！">>
    };
get(105) ->
    #{
        id => 105,
        title => <<"合服-幫會改名卡">>,
        content => <<"此次合服，您的幫會名稱和其他幫會重復，這是送給幫主您的幫會改名卡，請查收！">>
    };
get(106) ->
    #{
        id => 106,
        title => <<"幫會降級">>,
        content => <<"很遺憾，您所在幫會因為經營不善，缺乏幫會資金，已被自動降級！">>
    };
get(107) ->
    #{
        id => 107,
        title => <<"幫會分紅">>,
        content => <<"您在上周參與幫會管理活動，表現積極，獲得以下分紅獎勵，請查收！">>
    };
get(108) ->
    #{
        id => 108,
        title => <<"合服-玩家改名卡">>,
        content => <<"此次合服，您的名稱和其他玩家名稱重復，這是送給您的改名卡，請查收！">>
    };
get(201) ->
    #{
        id => 201,
        title => <<"結婚賀禮">>,
        content => <<"<font color=\"#5fc934\">~s</font>祝賀妳婚姻美滿，特奉上價值禮金道具壹份，請查收！">>
    };
get(202) ->
    #{
        id => 202,
        title => <<"結婚回禮">>,
        content => <<"妳祝賀<font color=\"#5fc934\">~s</font>和<font color=\"#5fc934\">~s</font>婚姻美滿，收到禮金道具回禮壹份，請查收">>
    };
get(203) ->
    #{
        id => 203,
        title => <<"揮淚斬情絲">>,
        content => <<"<font color=\"#5fc934\">~s</font>與您於<font color=\"#5fc934\">~w</font>年<font color=\"#5fc934\">~w</font>月<font color=\"#5fc934\">~w</font>日<font color=\"#5fc934\">~w</font>時<font color=\"#5fc934\">~w</font>分正式解除婚姻關系，望前塵路遠，且行且珍惜。">>
    };
get(301) ->
    #{
        id => 301,
        title => <<"背包空間不足">>,
        content => <<"您的背包已滿，請盡快熔煉裝備清理背包，郵件達到上限後無法領取新的郵件。">>
    };
get(401) ->
    #{
        id => 401,
        title => <<"宋遼戰場">>,
        content => <<"妳在宋遼戰場中表現優異，獲得<font color=\"#5fc934\">~w</font>點積分，請查收獎勵。">>
    };
get(402) ->
    #{
        id => 402,
        title => <<"武林盟主">>,
        content => <<"本次武林盟主活動，妳獲得了第<font color=\"#5fc934\">~w</font>名，請查收獎勵。">>
    };
get(403) ->
    #{
        id => 403,
        title => <<"武林盟主">>,
        content => <<"本次武林盟主活動，妳所在的幫會獲得了第<font color=\"#5fc934\">~w</font>名，請查收獎勵。">>
    };
get(501) ->
    #{
        id => 501,
        title => <<"拍賣分紅">>,
        content => <<"您在<font color=\"#5fc934\">~s</font>拍賣中獲得了分紅，請查收獎勵。">>
    };
get(502) ->
    #{
        id => 502,
        title => <<"拍賣所得">>,
        content => <<"恭喜您在<font color=\"#5fc934\">~s</font>拍賣會中花費<font color=\"#5fc934\">~w</font>元寶拍得<font color=\"#5fc934\">~s</font>×<font color=\"#5fc934\">~w </font>。">>
    };
get(503) ->
    #{
        id => 503,
        title => <<"拍賣退回">>,
        content => <<"您在<font color=\"#5fc934\">~s</font>拍賣中競拍失敗，退回參與拍賣的花費，請查收。">>
    };
get(504) ->
    #{
        id => 504,
        title => <<"壹口價拍賣">>,
        content => <<"恭喜您在<font color=\"#5fc934\">~s</font>拍賣會中直接花費<font color=\"#5fc934\">~w</font>元寶購買<font color=\"#5fc934\">~s</font>×<font color=\"#5fc934\">~w </font>。">>
    };
get(601) ->
    #{
        id => 601,
        title => <<"每日充值">>,
        content => <<"您昨天沒有領取每日充值獎勵，現通過郵件發放，請查收獎勵。">>
    };
get(701) ->
    #{
        id => 701,
        title => <<"馬賊寶箱">>,
        content => <<"恭喜您擊殺馬賊，繳獲馬賊寶箱獎勵，請查收。">>
    };
get(801) ->
    #{
        id => 801,
        title => <<"武林禁地幸運寶箱">>,
        content => <<"恭喜您在武林禁地中幸運獲得<font color=\"#5fc934\">~s</font>隱藏的寶藏，請查收。">>
    };
get(802) ->
    #{
        id => 802,
        title => <<"武林禁地擊敗寶箱">>,
        content => <<"恭喜您在武林禁地中擊敗<font color=\"#5fc934\">~s</font>，獲得豐厚的獎勵，請查收。">>
    };
get(901) ->
    #{
        id => 901,
        title => <<"幫會守衛戰獎勵">>,
        content => <<"您在本次幫會守衛戰中獲得<font color=\"#5fc934\">~s</font>積分，並獲得豐厚獎勵，請查收。">>
    };
get(1001) ->
    #{
        id => 1001,
        title => <<"門派競技參與獎勵">>,
        content => <<"您未曾領取門派競技的參與場次獎勵，現通過郵件發放，請查收。">>
    };
get(1002) ->
    #{
        id => 1002,
        title => <<"門派競技排名獎勵">>,
        content => <<"您在本次<font color=\"#5fc934\">~s</font><font color=\"#5fc934\">~s</font>組門派競技中獲得<font color=\"#5fc934\">~s</font>積分，排名第<font color=\"#5fc934\">~s</font>，獲得門派競技排名的獎勵，請查收。">>
    };
get(1003) ->
    #{
        id => 1003,
        title => <<"大師兄獎勵">>,
        content => <<"您獲得了在<font color=\"#5fc934\">~s</font>大師兄的獎勵，請查收。">>
    };
get(1101) ->
    #{
        id => 1101,
        title => <<"擊殺鏡湖匪首">>,
        content => <<"您在鏡湖剿匪活動中成功擊殺<font color=\"#5fc934\">混江龍</font>，獲得豐厚的獎勵，請查收。">>
    };
get(1102) ->
    #{
        id => 1102,
        title => <<"鏡湖剿匪">>,
        content => <<"您在鏡湖剿匪活動中擊殺匪類，獲得剿匪獎勵，請查收。">>
    };
get(1201) ->
    #{
        id => 1201,
        title => <<"幫會任務階段獎勵">>,
        content => <<"感謝少俠在上周的幫會任務活動中做出的卓越貢獻，上周幫會任務已完成第<font color=\"#5fc934\">~s</font>階段，獲得豪華獎勵，請查收。希望少俠再接再厲，繼續加油！">>
    };
get(1301) ->
    #{
        id => 1301,
        title => <<"科舉考試獎勵">>,
        content => <<"在科舉考試中，少俠名列前茅，排名第<font color=\"#5fc934\">~w</font>名，獲得豐厚獎勵，請查收。">>
    };
get(1401) ->
    #{
        id => 1401,
        title => <<"演武堂">>,
        content => <<"在演武堂活動中，妳獲得了<font color=\"#5fc934\">~w</font>積分，獲得以下獎勵，請查收。">>
    };
get(1402) ->
    #{
        id => 1402,
        title => <<"演武堂最後壹擊">>,
        content => <<"在演武堂活動中，妳對演武守將造成了最後壹擊，獲得以下獎勵，請查收。">>
    };
get(1501) ->
    #{
        id => 1501,
        title => <<"行酒令幸運大禮包">>,
        content => <<"您在行酒令活動的幸運骰子環節中，運氣爆棚，獲得<font color=\"#5fc934\">行酒令幸運大禮包</font>！！請及時領取！">>
    };
get(1502) ->
    #{
        id => 1502,
        title => <<"行酒令安慰大禮包">>,
        content => <<"您在行酒令活動的幸運骰子環節中，獲得<font color=\"#5fc934\">行酒令安慰大禮包</font>！！請及時領取！">>
    };
get(1601) ->
    #{
        id => 1601,
        title => <<"領地戰獲勝">>,
        content => <<"妳所在的幫會在領地戰中成功擊敗對手，請查收以下獎勵！">>
    };
get(1602) ->
    #{
        id => 1602,
        title => <<"領地戰失敗">>,
        content => <<"妳所在的幫會在領地戰中惜敗，還需再接再厲，請查收以下獎勵！">>
    };
get(1701) ->
    #{
        id => 1701,
        title => <<"稀有商品出售">>,
        content => <<"您出售的稀有商品：<font color=\"#5fc934\">~s</font>×<font color=\"#5fc934\">~w</font>已被購買，獲得<font color=\"#5fc934\">~w</font>儲蓄元寶，稅金：<font color=\"#5fc934\">~w</font>儲蓄元寶。">>
    };
get(1702) ->
    #{
        id => 1702,
        title => <<"商品出售">>,
        content => <<"您出售的商品：<font color=\"#5fc934\">~s</font>×<font color=\"#5fc934\">~w</font>已被購買，獲得<font color=\"#5fc934\">~w</font>銀兩，稅金：<font color=\"#5fc934\">~w</font>銀兩。">>
    };
get(1703) ->
    #{
        id => 1703,
        title => <<"商品過期提示">>,
        content => <<"您出售的商品已過期，普通商品<font color=\"#5fc934\">7天</font>後將自動銷毀，請及時查看。稀有商品將不會銷毀。">>
    };
get(1704) ->
    #{
        id => 1704,
        title => <<"商品刪除提示">>,
        content => <<"<font color=\"#5fc934\">~s</font>商品已到期，系統回收了您出售的普通道具，稀有道具不會銷毀。">>
    };
get(1801) ->
    #{
        id => 1801,
        title => <<"每周回饋獎勵">>,
        content => <<"您上周未領取每周回饋獎勵，現通過郵件進行發放，請及時領取。">>
    };
get(1901) ->
    #{
        id => 1901,
        title => <<"每日禮包">>,
        content => <<"妳前天未領取的每日禮包獎勵，現通過郵件進行發放，請及時領取。">>
    };
get(2001) ->
    #{
        id => 2001,
        title => <<"群組自動解散">>,
        content => <<"群組<font color=\"#5fc934\">~s</font>長期無人溝通，24小時後會被自動解散，請留意。">>
    };
get(2101) ->
    #{
        id => 2101,
        title => <<"幫會工資">>,
        content => <<"妳上周未領取的幫會工資獎勵，現通過郵件進行發放，請及時領取。">>
    };
get(2201) ->
    #{
        id => 2201,
        title => <<"稱號過期郵件">>,
        content => <<"<font color=\"#5fc934\">~s</font>稱號已到期，稱號正式失效。">>
    };
get(2301) ->
    #{
        id => 2301,
        title => <<"來自喬峰的壹封信">>,
        content => <<"正文：\n少俠臺鑒：\n      瑯嬛匆匆壹別，甚為倉促。雖喬某有心與君痛飲長談，然幫中事務纏身，又遭瑯嬛之變，未有閑暇，還請下見諒。天下之大，喬某不敢妄言，而此中英豪才俊，更是濟濟繁多，是以能得遇少俠，實為喬某之幸。閱下初涉江湖，嶄然頭角崢嶸，他日相逢，想必已成就壹番名望。每念於此，喬某亦感榮焉。\n      昔日瑯嬛洞天之事，喬峰未曾言謝，故寄書言表，以感閣下恩情。世人皆言，瑯嬛福地內藏有蓋世秘籍，多少天下豪傑，皆以趨之若鶩。卻未曾料想，星宿歹人包藏禍心，投毒逞兇，而丁春秋更所圖良多，以求先得秘籍，後得天下。昔時若非少俠仗義相助，其所圖謀恐已成功，而諸位武林同道，乃至我丐幫弟子，定會死傷無數。故閣下恩德，在下莫不敢忘。此情灼灼，唯有他日宴請閣下，徹夜痛飲，方解壹二。\n      臨書倉卒，不盡欲言。江湖路遠，喬某但祝少俠順途達行，萬事可成。">>
    };
get(2302) ->
    #{
        id => 2302,
        title => <<"來自趙天師的壹封信">>,
        content => <<"正文：\n小友親啟：\n      昔日初見小友，老朽便知小友非尋常人，武藝精湛，品性純良，他日成就不可限量。而卻未曾料到，短短幾日不見小友便能有所作為。如今蘇州城中百姓皆言小友良行善舉，老朽得聞，不勝欣慰。\n      此前不久，老朽曾收蘇州府尹蔣忻來函，書中言辭切，皆道小友品貌高潔。蔣公先行致謝小友掃除葛榮山寨之舉，字字嘉獎，句句贊揚。而後又提及蔣家幹金姻緣壹事，蔣公對鄴公子態度已有改觀，消弭隔閡指日可待。由是觀之，小友所為當真已深得民心，故此美名方得傳揚。而前些時日，又有大理段世子告知老朽，小友與丐幫喬幫主曾共探珍瓏棋局，並深得聰辯先生賞識，想必小友武藝有所精進，並從棋局中得益匪淺。\n      江湖之事，道途悠遠，老朽惟願小友謹言慎行，善自珍重。待小友功成名就，威名遠場之時，老朽定會備上賀禮，與小友好生慶祝壹番。臨書倉卒，不盡欲言，還請小友見諒。">>
    };
get(2303) ->
    #{
        id => 2303,
        title => <<"來自阿朱的壹封信">>,
        content => <<"正文：\n少俠親啟：\n      自聚賢莊壹別，久疏問候，還望少俠勿怪，不知少俠壹切佳勝？\n      昔日阿朱與喬大哥在聚賢莊遇險，承蒙少俠出手相助，喬大哥方得以脫困而去。此等大恩，阿朱此生不敢忘。時至今日，小女子每每閉目，當時之種種危難，重重殺機尚在眼前，心驚難平。而少俠於險惡境地，仍願不顧安危，仗義相救，阿朱感恩於心，卻又愧疚難當。\n      所幸，喬大哥已被黑衣人救去，薛神醫亦信守諾言為我療傷，數日後便可痊愈，少俠不必掛牽。但江湖險惡，少俠孤身壹人，還請萬事小心。少俠大義高潔，阿朱惟願君諸事順達。\n      聚賢莊壹戰，喬大哥於阿朱恩重如山，婢子此生已不作他人想。他日若有重逢之時，必將永世追隨喬大哥左右，相知相伴，浪跡天涯。少俠行走江湖時，若得喬大哥音訊，煩請飛鴿傳書，告知於妾，阿朱千恩萬謝，銘感無已。\n      特此致候，不勝依依。">>
    };
get(2304) ->
    #{
        id => 2304,
        title => <<"來自段譽的壹封信">>,
        content => <<"正文：\n少俠臺鑒：\n      自上次與少俠長敘閑談，已有多日。不知少俠近來可好？段譽心系於此，故寄書壹封，聊表掛牽。\n      小弟段譽自幼居於深宮府邸，蒙受父母、叔伯恩寵，雖身為大理世子，卻無壹至交好友。前些時日，段譽偷偷出宮，壹路遊山玩水，自在逍遙。只可惜景物雖美，沿途所遇之人，其人品見識皆不足道。但自與少俠相識以來，心中猶生相見恨晚之意。那日天龍寺中，吐蕃國師鸕摩智自恃絕世神通，意欲強奪六脈神劍劍譜。少俠毫無懼色，以凜然正氣懾方外之妖邪，相助段譽擊退來犯之人。此種風發意氣，段譽拜服不已。少俠品行高潔，武藝又精妙高強，人生能得此知己，段譽三生有幸！\n      鳩摩智居心叵測，且此人武功奇高。少俠若於江南遇見，可要萬分小心。段譽惟盼能早日與閣下重逢，促膝長談，實為人生快事。\n      言不盡思，再祈珍重。">>
    };
get(2305) ->
    #{
        id => 2305,
        title => <<"來自王語嫣的壹封信">>,
        content => <<"正文：\n少俠親啟：\n      曼陀山莊壹別後，不知少俠近來可好？小女子念及少俠恩德，心中掛牽，便索性研墨執筆書信予妳。\n      那日於聽香水榭，少俠壹番武藝甚是高明，尤其是貴派獨門武功更是神乎其技，將那司馬林、褚保昆等人壹招制服，現在細細想來，著實令語嫣欽佩不已！當日，若非有少俠相救，擊退那些前來肆擾逞兇的不速之客，想必今日，語嫣已是深陷絕境，更莫論今日尚能遊歷江湖，尋覓表兄。此等大恩，不勝言辭。\n      分別之後，阿朱、阿碧與小女子壹路奔波，行道湖州，適逢巧遇包三哥。並自彼處得知，武林近來風波漸起，頗不平靜。西夏壹品堂有大批高手前來中原滋事尋釁，不知何意。又有歹人四處胡作非為，嫁禍於“姑蘇慕容”，是以語嫣等人決意壹同前去，壹探究竟。若天公作美，或許能探得慕容表兄的下落！\n      當日救命之恩，無以言表，順信寄與壹點心意，禮饋輕薄，還望少俠不棄。書不能悉意，聊表寄思。">>
    };
get(2306) ->
    #{
        id => 2306,
        title => <<"來自段正淳的壹封信">>,
        content => <<"正文：\n少俠臺鑒：\n      自古世事緣法，高深莫測。而命中得失反復，不由吾心，人生喜樂與悲愁，莫不如是！\n      與閣下相識本是妙事壹樁，適逢段某復得舊年所失二女，本是暢快通達，喜不自禁。卻未曾料想，世間本多樂極生悲之事，轉瞬間小女阿朱便玉殞香消，此中悲痛，段某無以言表。\n      念及為化解與喬峰之間仇怨，亦為還小女之公道，數日前，段某尋到康敏住處。只見那紅燭白衫，依稀雖還是我倆舊時相好時的模樣，但卻不想，這諸多恩怨皆因其心中嫉妒怨怒而起。而段某亦因舊時多情，連累了小女阿朱，白白折煞了性命。\n      段某與喬幫主今日已於洛陽分別，彼所探尋之帶頭大哥，仍是謎團難辨，失了線索。喬幫主悵然北去，而在下也意欲南下返程。當日少俠相助共戰四大惡人壹事，段某感恩於心，莫不敢忘。若少俠他日行至大理，段某定掃榻相迎。\n      書信草草，恕不壹壹。海天在望，少俠亦要善自保重！">>
    };
get(2307) ->
    #{
        id => 2307,
        title => <<"來自蘇星河的壹封信">>,
        content => <<"正文：\n少俠親啟：\n      昔日承蒙閣下於擂鼓山珍瓏棋局中相助，敝派不勝感激。老夫壹直未逢良機相謝，唯有修書壹封，頓首感懷，並附區區薄禮，以償恩情，還望少俠切莫相拒。\n      家師昔年壹時不慎，為本門叛逆賊子丁春秋所乘，身負重傷，只能藏身於擂鼓山中。為尋得悟性與品行俱佳之人，接掌逍遙派掌門之位，家師布下這珍瓏棋局，於這黑白十九道中管窺諸位武林俠士心性與資質。許是天意如此，老夫這掌門師弟，自填壹眼，誤破殘局，雖天資平平，但這不爭得失、不念勝敗的道心，日後必然有所成就。而當日又幸得閣下相助，師弟順利承受家師七十年功法，想必清理門戶之日已然不遠。\n      老夫聽聞掌門師弟所言，除卻誅殺逆賊丁春秋之外，家師另有壹夙願相囑，此事恐有壹番波折。掌門師弟江湖經驗尚淺，若日後與閣下有緣再會，還請少俠不吝援手，相助其壹臂之力。此等恩情，老夫定銘心不忘。\n      草率書此，祈恕不恭。江湖路遠，還望少俠珍重。">>
    };
get(2308) ->
    #{
        id => 2308,
        title => <<"來自虛竹的壹封信">>,
        content => <<"正文：\n少俠臺鑒：\n      幸得少俠援手，縹緲峰的諸位姐姐，方能與三十六洞七十二島的施主們罷手言和，少了許多殺傷，善哉善哉。少俠離去匆忙，而小僧年輕識淺，不喑世事，幸蒙竹劍姐姐提醒，方知要好生叩謝少俠相助之恩。虛竹便匆匆修書壹封，言謝再三，以表心意。\n      近些時日，小僧於靈鷲宮中，時常念起少林寺中的方文和諸位師父。小僧自幼於寺中長大，雖破了佛門的諸般戒律，但若是從此不歸山門，委實忘恩負義。心念於此，小僧便決意待安頓好這靈鷲宮中事後，便返回少林寺，向方丈和師父領罪。少俠若有閑暇，可前往少林寺與小僧壹聚。\n      世間萬事無常，講究緣法。小僧能與少俠結為至交好友，便是壹番善緣。而前日，小僧與大理段世子義結金蘭時，聽聞世子論及少俠亦與其相交匪淺，小僧便深覺，少俠與小僧，與段世子相交壹場，實為天意使然，定要好生珍惜。\n      書不盡意，言不盡思，惟有再祈珍重。他日重逢，小僧壹定躬身以謝少俠恩情。">>
    };
get(2401) ->
    #{
        id => 2401,
        title => <<"十大幫會獎勵">>,
        content => <<"妳所在的<font color=\"#5fc934\">~s</font>幫派排名第<font color=\"#5fc934\">~w</font>名，現通過郵件發放排名獎勵，請及時領取。">>
    };
get(2501) ->
    #{
        id => 2501,
        title => <<"凝魂次數獎勵">>,
        content => <<"妳的武魂已累計凝魂<font color=\"#5fc934\">~w</font>次，獲得以下獎勵，請查收">>
    };
get(2510) ->
    #{
        id => 2510,
        title => <<"少室山副本獎勵">>,
        content => <<"貴幫已通關少室山<font color=\"#5fc934\">~s</font>關卡，前2次通關該關卡獎勵較多，2次後逐漸衰減，當達到5次後將不再獲得通關獎勵。當前為<font color=\"#5fc934\">第~w次</font>挑戰成功，獲得以下獎勵，請查收">>
    };
get(2601) ->
    #{
        id => 2601,
        title => <<"離婚郵件">>,
        content => <<"妳於<font color=\"#5fc934\">~s</font>與<font color=\"#5fc934\">~s</font>解除婚約，從此各行各路，相忘於江湖。">>
    };
get(2602) ->
    #{
        id => 2602,
        title => <<"離婚郵件">>,
        content => <<"<font color=\"#5fc934\">~s</font>於<font color=\"#5fc934\">~s</font>與妳解除婚約，從此各行各路，相忘於江湖。">>
    };
get(2701) ->
    #{
        id => 2701,
        title => <<"眾裏尋卿獎勵">>,
        content => <<"妳與<font color=\"#5fc934\">~s</font>在眾裏尋卿中契合度達到520，獲得特殊禮物壹份，請查收。">>
    };
get(2702) ->
    #{
        id => 2702,
        title => <<"眾裏尋卿契合獎勵">>,
        content => <<"妳在眾裏尋卿中有未領取的契合度獎勵，請查收。">>
    };
get(2703) ->
    #{
        id => 2703,
        title => <<"眾裏尋卿">>,
        content => <<"本次眾裏尋卿的7天契約活動結束，相比少俠也同對方有了壹定的了解！少俠即可尋覓新的心願卡，也可與意中人繼續結成新的契約！">>
    };
get(2801) ->
    #{
        id => 2801,
        title => <<"出師獎勵">>,
        content => <<"妳的徒弟<font color=\"#5fc934\">~s</font>在拜師期間獲得學業成績<font color=\"#5fc934\">~w</font>點，現已順利出師，妳獲得了以下獎勵，請查收。">>
    };
get(2802) ->
    #{
        id => 2802,
        title => <<"出師獎勵">>,
        content => <<"妳在師父<font color=\"#5fc934\">~s</font>的教導下獲得學業成績<font color=\"#5fc934\">~w</font>點，現已順利出師，獲得了以下獎勵，請查收。">>
    };
get(2803) ->
    #{
        id => 2803,
        title => <<"太學冊獎勵">>,
        content => <<"妳的徒弟<font color=\"#5fc934\">~s</font>完成了<font color=\"#5fc934\">~w</font>個太學冊任務，妳獲得了以下獎勵，請查收。">>
    };
get(2804) ->
    #{
        id => 2804,
        title => <<"太學冊獎勵">>,
        content => <<"妳在師父<font color=\"#5fc934\">~s</font>的教導下完成了<font color=\"#5fc934\">~w</font>個太學冊任務，獲得了以下獎勵，請查收。">>
    };
get(2805) ->
    #{
        id => 2805,
        title => <<"逐出師門">>,
        content => <<"由於<font color=\"#5fc934\">~s</font>，妳的徒弟<font color=\"#5fc934\">~s</font>被妳逐出師門。">>
    };
get(2806) ->
    #{
        id => 2806,
        title => <<"逐出師門">>,
        content => <<"由於<font color=\"#5fc934\">~s</font>，妳被<font color=\"#5fc934\">~s</font>被妳逐出師門。">>
    };
get(2807) ->
    #{
        id => 2807,
        title => <<"叛離師門">>,
        content => <<"妳的徒弟<font color=\"#5fc934\">~s</font>，和妳意向不合，叛離了師門。">>
    };
get(2808) ->
    #{
        id => 2808,
        title => <<"叛離師門">>,
        content => <<"妳和師父<font color=\"#5fc934\">~s</font>意向不合，叛離了師門。">>
    };
get(2901) ->
    #{
        id => 2901,
        title => <<"秦皇陵爭奪戰">>,
        content => <<"妳在秦皇陵爭奪戰中表現優異，獲得<font color=\"#5fc934\">~w</font>點積分，排名第<font color=\"#5fc934\">~w</font>名，請查收獎勵。">>
    };
get(2902) ->
    #{
        id => 2902,
        title => <<"巔峰秦皇陵">>,
        content => <<"妳在巔峰秦皇陵中表現優異，獲得<font color=\"#5fc934\">~w</font>點積分，排名第<font color=\"#5fc934\">~w</font>名，獲得<font color=\"#5fc934\">~w</font>個擊殺和<font color=\"#5fc934\">~w</font>個助攻，請查收獎勵。">>
    };
get(3001) ->
    #{
        id => 3001,
        title => <<"江湖之路">>,
        content => <<"江湖之路已開啟<font color=\"#5fc934\">壹天</font>現已開啟新追求：<font color=\"#5fc934\">遊天下</font>，在此我們預備了豐厚獎勵，等待妳來挑戰。">>
    };
get(3002) ->
    #{
        id => 3002,
        title => <<"江湖之路">>,
        content => <<"江湖之路已開啟<font color=\"#5fc934\">二天</font>現已開啟新追求：<font color=\"#5fc934\">俠客行</font>，在此我們預備了豐厚獎勵，等待妳來挑戰。">>
    };
get(3003) ->
    #{
        id => 3003,
        title => <<"江湖之路">>,
        content => <<"江湖之路已開啟<font color=\"#5fc934\">三天</font>現已開啟新追求：<font color=\"#5fc934\">任逍遙</font>，在此我們預備了豐厚獎勵，等待妳來挑戰。">>
    };
get(3004) ->
    #{
        id => 3004,
        title => <<"江湖之路">>,
        content => <<"江湖之路已開啟<font color=\"#5fc934\">四天</font>現已開啟新追求：<font color=\"#5fc934\">武林尊</font>，在此我們預備了豐厚獎勵，等待妳來挑戰。">>
    };
get(3101) ->
    #{
        id => 3101,
        title => <<"沖級獎勵">>,
        content => <<"恭喜妳將等級提升至<font color=\"#5fc934\">24</font>級，江湖路險，山高路遠。壹點小小心意贈與少俠，望少俠再接再厲，再創江湖傳奇！">>
    };
get(3102) ->
    #{
        id => 3102,
        title => <<"沖級獎勵">>,
        content => <<"恭喜妳將等級提升至<font color=\"#5fc934\">32</font>級，江湖路險，山高路遠。壹點小小心意贈與少俠，望少俠再接再厲，再創江湖傳奇！">>
    };
get(3103) ->
    #{
        id => 3103,
        title => <<"沖級獎勵">>,
        content => <<"恭喜妳將等級提升至<font color=\"#5fc934\">38</font>級，江湖路險，山高路遠。壹點小小心意贈與少俠，望少俠再接再厲，再創江湖傳奇！">>
    };
get(3104) ->
    #{
        id => 3104,
        title => <<"沖級獎勵">>,
        content => <<"恭喜妳將等級提升至<font color=\"#5fc934\">42</font>級，江湖路險，山高路遠。壹點小小心意贈與少俠，望少俠再接再厲，再創江湖傳奇！">>
    };
get(3105) ->
    #{
        id => 3105,
        title => <<"沖級獎勵">>,
        content => <<"恭喜妳將等級提升至<font color=\"#5fc934\">45</font>級，江湖路險，山高路遠。壹點小小心意贈與少俠，望少俠再接再厲，再創江湖傳奇！">>
    };
get(3106) ->
    #{
        id => 3106,
        title => <<"沖級獎勵">>,
        content => <<"恭喜妳將等級提升至<font color=\"#5fc934\">48</font>級，江湖路險，山高路遠。壹點小小心意贈與少俠，望少俠再接再厲，再創江湖傳奇！">>
    };
get(3107) ->
    #{
        id => 3107,
        title => <<"沖級獎勵">>,
        content => <<"恭喜妳將等級提升至<font color=\"#5fc934\">50</font>級，江湖路險，山高路遠。壹點小小心意贈與少俠，望少俠再接再厲，再創江湖傳奇！">>
    };
get(3108) ->
    #{
        id => 3108,
        title => <<"沖級獎勵">>,
        content => <<"恭喜妳將等級提升至<font color=\"#5fc934\">52</font>級，江湖路險，山高路遠。壹點小小心意贈與少俠，望少俠再接再厲，再創江湖傳奇！">>
    };
get(_ID) ->
    undefined.

get_ids() ->
    [1, 2, 3, 11, 12, 21, 31, 32, 100, 101, 102, 103, 104, 105, 106, 107, 108, 201, 202, 203, 301, 401, 402, 403, 501, 502, 503, 504, 601, 701, 801, 802, 901, 1001, 1002, 1003, 1101, 1102, 1201, 1301, 1401, 1402, 1501, 1502, 1601, 1602, 1701, 1702, 1703, 1704, 1801, 1901, 2001, 2101, 2201, 2301, 2302, 2303, 2304, 2305, 2306, 2307, 2308, 2401, 2501, 2510, 2601, 2602, 2701, 2702, 2703, 2801, 2802, 2803, 2804, 2805, 2806, 2807, 2808, 2901, 2902, 3001, 3002, 3003, 3004, 3101, 3102, 3103, 3104, 3105, 3106, 3107, 3108].
