%% -*- coding: latin-1 -*-
%%------------------------------------------------------------------------------
%% @File   : conf_smelt_soul
%% @Brief  : 熔炼器魂
%% @Author : Ryuu
%%------------------------------------------------------------------------------
-module(conf_smelt_soul).

-export([
    get/1,
    get_ids/0
]).

get(1) ->
    #{
        id => 1,
        name => <<"">>
    };
get(2) ->
    #{
        id => 2,
        name => <<"">>
    };
get(3) ->
    #{
        id => 3,
        name => <<"">>
    };
get(4) ->
    #{
        id => 4,
        name => <<"">>
    };
get(_ID) ->
    undefined.

get_ids() ->
    [1, 2, 3, 4].
